Repository: mozilla-l10n/mt-training-data
Catalog: zu/zu_pontoon.tmx
Source language: en_us
Languages: zu

source: Recently approved updates
zu: Izinto ezintsha ezisanda kugunyazwa

source: Recently Awarded
zu: Okusanda kuhlonyuliswa

source: Recently awarded badges
zu: Amabheji asanda kuhlonyuliswa

source: Recently unanswered
zu: Okusanda kuphendulwa

source: Recently updated questions
zu: Imibuzo esanda kulungiswa

source: Recently updated questions tagged %s
zu: Imibuzo esanda kuvuselelwa ethegiwe %s

source: Recently updated threads about %s
zu: Usanda kuvuselela uchungechunge mayelana ne-%s

source: Recent posts in %s
zu: Amaphosti amasha ku-%s

source: Recent Revisions
zu: Isibukezo Zakamuva

source: [Recursive inclusion of "%s"]
zu: [Ukubandakanya ngokulandelana kwe "%s"]

source: (Redirected from <a href="{href}">{title}</a>)
zu: (Uchezukiswe kusuka <a href="{href}">{title}</a>)

source: Redirecting
zu: Usajikiswa

source: Redirects
zu: Iyachezukisa

source: Refresh
zu: Vuselela

source: Refresh Firefox
zu: Vuselela i-Firefox

source: Regards, <br />The SUMO team.
zu: Ozithobayo, <br />Ithimba le-SUMO.

source: Regards, The SUMO team
zu: Ngokuzithoba, ithimba lakwa-SUMO

source: Register or sign in
zu: Rejista noma sayinela ukungena

source: Register or Sign In
zu: Bhalisela noma Sayinela ukungena

source: Register to be a Contributor
zu: Bhalisa njengonegalelo

source: registration profile
zu: ukubhaliswa kwephrofayela

source: registration profiles
zu: ukubhaliswa kwamaphrofayela

source: Rejected
zu: Kunqatshiwe

source: Related
zu: Okuhlobene

source: Related documents:
zu: Dilitha Idokhumenti:

source: Related products
zu: Eminye imikhiqizo efana nalena

source: Related to the Lightning add-on for Calendar
zu: Ngokuhlobene ne-Lightning add-on yeKhalenda

source: Release Notes
zu: Khipha Amanothi

source: Relevance
zu: Okufanele

source: Relevant to
zu: Okuhlobene nokunye

source: Relevant to:
zu: Ihlobene ne:

source: Remove
zu: Khipha

source: Remove contributor
zu: Khipha onegalelo

source: Remove Contributor
zu: Khipha Onegalelo

source: Remove contributor | {document}
zu: Khipha onegalelo | {document}

source: Remove leader
zu: Khipha umholi

source: Remove member
zu: Khipha ilungu

source: Remove {role}
zu: Khipha {role}

source: Remove tweets that aren't really about Firefox or don't need a reply
zu: Susa ama-tweet angahlangene ne-Forefox noma angadingi impendulo

source: Remove user from contributors
zu: Susa umsebenzisi kwabanegalelo

source: Remove user from group
zu: Khipha umsebenzisi eqenjini

source: Remove user from leaders
zu: Susa umsebenzisi kubaholi

source: Remove user from locale editors
zu: Susa umsebenzisi kubahleli basendaweni

source: Remove user from locale leaders
zu: Susa umsebenzisi kubaholi basendaweni

source: Remove user from locale reviewers
zu: Susa umsebenzisi kubabukezi basendaweni

source: Replies
zu: Izimpendulo

source: reply
zu: baphendule

source: Reply
zu: Phendula

source: Reply...
zu: Phendula...

source: Reply Preview
zu: Phendula isibukisi kuqala

source: Reply-to is empty
zu: Okuzophendulwa akunalutho

source: Reply to thread: {title}
zu: Phendula kuchungechunge: {title}

source: Report this
zu: Bika lokhu

source: Request type not recognized.
zu: Uhlobo lwesicelo alwaziwa.

source: Required. 30 characters or fewer. Letters, digits and ./- only.
zu: Okudingekayo: Izinhlamvu ezingama-30. Izinhlamvu zamagama, amadijithi kanye /- kuphela.

source: Re: %s
zu: Mayelana: %s

source: Resend account confirmation email
zu: Thumela kabusha i-imeyli yokuqinisekisa i-akhwunti

source: Resend confirmation email
zu: Thumela kabusha i-imeyli yokuqinisekisa

source: Responded
zu: Kuphenduliwe

source: % Responded in 24 hours
zu: % Phendulwe emahoreni angama-24

source: Responded in 24 hours
zu: Phendulwe emahoreni angama-24

source: % Responded in 72 hours
zu: % Phendulwe emahoreni angama-72

source: Responded in 72 hours
zu: Phendulwe emahoreni angama-72

source: Respond to the tweet!
zu: Phendula i-tweet!

source: Response editor
zu: Umhleli wempendulo

source: Response preview
zu: Ukubukwa kuqala kwempendulo

source: Responses
zu: Izimpendulo

source: Results
zu: Imiphumela

source: Results for: {query}
zu: Imiphumela yalokhu: {query}

source: Retrieve username
zu: Khipha igama lomsebenzisi

source: Retrieve Username
zu: Khipha Igama lomsebenzisi

source: Reveal password to check that it's right
zu: Veza iphasiwedi ukuhlola ukuthi ilungile na

source: Reviewed
zu: Kubukeziwe

source: Reviewed:
zu: Kubukeziwe:

source: Reviewed by:
zu: Kubukezwe ngu:

source: %(reviewer)s has approved the revision to the document %(document_title)s.
zu: %(reviewer)s bagunyaze ukubukezwa kwedokhumenti %(document_title)s.

source: %(reviewer)s has approved your revision to the document %(document_title)s.
zu: %(reviewer)s bagunyaze ukubukeza kwakho kule dokhumenti %(document_title)s.

source: %(reviewer)s has reviewed your revision to the document %(document_title)s.
zu: %(reviewer)s babukeze iveshini yakho kule dokhumenti %(document_title)s.

source: Reviewing Revision {id} by {user}
zu: Kubukezwa Isibukezo {id} ngu {user}

source: Reviewing Translation {id} in {language} by {user}
zu: Ubukeza Isihumusho {id} nge {language} {user}

source: Review Needed
zu: Ukubukeza Kuyadingeka

source: Review Needed: {comment}
zu: Kudingeka Ukubukeza: {comment}

source: Review Process
zu: Inqubo Yokubukeza

source: Review Revision
zu: Ukubukezwa Kwesibukezo

source: Review Revision {id} | {document}
zu: Ukubukezwa Kwesibukezo {id} | {document}

source: Review Revision of {title}
zu: Ukubukezwa Kwesibukezo kwesi {title}

source: [Reviews Pending: %s] SUMO needs your help!
zu: [Ukubukezwa kusazokwenziwa: %s] I-SUMO idinga usizo lwakho!

source: Review this revision
zu: Bukeza lesi sibukezo

source: Review Translation
zu: Bukeza Isihumusho

source: Review Translation {id} | {document}
zu: Bukeza Isihumusho {id} | {document}

source: Review Translation of {title}
zu: Isibukezo Sesihumusho se {title}

source: Revision
zu: Isibukezo

source: Revision Comment: {comment}
zu: Ukubukeza Kokuphawula {comment}

source: Revision Content
zu: Ukubukezwa Kokuqukethwe

source: Revision History | {document}
zu: Ukubukezwa Komlando | {document}

source: Revision history for:
zu: Ukubukezwa komlando we:

source: Revision id:
zu: I-id ebukeziwe:

source: Revision {id} by {user} on {date}
zu: Isibukezo {id} senziwe ngu {user} ngomhlaka {date}

source: Revision Information
zu: Imininingwane Yesibukezo

source: Revision {n} | {t} | {c}
zu: Isibukezo {n} | {t} | {c}

source: Revision {num}
zu: Isibukezo {num}

source: Revision {num}:
zu: Izibukezo {num}:

source: Revision rendered html:
zu: Isibukezo sinikeze i-html:

source: Revision %s
zu: Isibukezo %s

source: Revision source:
zu: Umthombo wesibukezo:

source: Revision Source
zu: Umthombo Wesibukezo

source: said
zu: uthe

source: salt
zu: usawoti

source: Save
zu: Londoloza

source: Save changes
zu: Londoloza izinguquko

source: Save description
zu: Londoloza incazelo

source: Save image
zu: Londoloza umfanekiso

source: Save Question
zu: Londoloza Umbuzo

source: Save, share and sync
zu: Londoloza, yabelana bese uqondanisa

source: Save, share and synchronize content with other devices
zu: Londoloza, yabelana bese uqondanisa ulwazi namanye amadivayisi

source: Save the world
zu: Sindisa umhlaba

source: Save the world from the comfort of your couch
zu: Sindisa umhlaba uzithokomalele kusofa wakwakho

source: %s characters remaining
zu: %s izinhlamvu ezisasele

source: Search
zu: Cinga

source: Search and navigate easily with these essential features
zu: Cinga bese uuhambe kalula ngala mafisha abalulekile

source: Search Clickthrough Rate
zu: Cinga Izinga Labachofozabedlula

source: Search for a user...
zu: Cinga umsebenzisi...

source: Search for common responses
zu: Cinga izimpendulo ezivamile

source: Search for documents...
zu: Cinga isithangami...

source: Search Gallery
zu: Cinga Igalari

source: Search in forum
zu: Cinga isithangami

source: Search is temporarily unavailable. Please try again in a few minutes.
zu: Uhlelo lokucinga alutholakali okwalesi sikhashana. Uyacelwa uphinde uzame emva kwemizuzwana.

source: Search Mozilla Support
zu: Cinga Ukwesekwa Kwe-Mozilla

source: Search results summary:
zu: Cinga imiphumela yesifingqo:

source: Search result summary:
zu: Isifingqo somphumela wokucinga:

source: Search result summary in {locale}:
zu: Umphumela wokucinga ofingqiwe ku {locale}:

source: Search the Discussion Forums
zu: Cinga Izithangami Zezingxoxo

source: Search the Knowledge Base
zu: Cinga Ulwazi Oluyisisekelo

source: Search the Mozilla Support Knowledge Base and Support Forum.
zu: Cinga Ulwazi Oluyisisekelo lwe-Mozilla Support kanye Nesithangami Sokusekela.

source: Search the Support Questions
zu: Cinga Imibuzo Esekelayo

source: Search Unavailable
zu: Ukucinga Akutholakali

source: See <a href="%(url)s">the history</a> to base your edit on an existing unreviewed revision.
zu: Buka <a href="%(url)s">umlando</a> ukuze usekele kuwo izilungiso zakho esibukezweni esikhona.

source: See All
zu: Buka Konke

source: See all available SUMO badges
zu: Buka wonke amabheji e-SUMO atholakalayo

source: See all the details:
zu: Buka yonke imininingwane:

source: See all the details...
zu: Buka yonke imininingwane...

source: See also:
zu: Buka lokhu futhi:

source: See the comment:
zu: Buka ukuphawula:

source: See the data
zu: Buka imininingo

source: See what you can do to help
zu: Bona ukuthi ungenzani ukuze usize

source: See your question here:
zu: Buka umbuzo wakho lapha:

source: Select a language to translate to:
zu: Khetha ulimi ozohumushela kulo:

source: Select by Locale
zu: Khetha ngokwesizinda

source: Select language
zu: Khetha ulimi

source: Select language | {document}
zu: Khetha ulimi | {document}

source: Seller will not provide support
zu: Umdayisi ngeke ahlinzeke ngokweseka

source: Send
zu: Thumela

source: Send emails for private messages
zu: Thumela ama-imeyli emiyalezo yasesithe

source: {sender} sent you the following message:
zu: {sender} ukuthumele umyalezo olandelayo:

source: Send password reset link
zu: Thumela iphasiwedi yokusetha ilinki

source: Send Updates
zu: Thumela Okuvuselelwe

source: Send username
zu: Thumela igama lomsebenzisi

source: Sensible Settings
zu: Amasethingi Aphusile

source: Sent Message
zu: Umyalezo Othunyelwe

source: Sent Messages
zu: Imiyalezo Ethunyelwe

source: Setting a date and time on your Firefox OS phone
zu: Ukusetha usuku nesikhathi efonini yakho ye-Firefox OS

source: Set up email
zu: Setha kahle i-imeyli

source: Share Data
zu: Yaba Imininingo

source: Share this article: {link}
zu: Yabelana ngale athikhili : {link}

source: Share web pages on Firefox for iOS
zu: Yabelana ngamakhasi e-inthanethi ku-Firefox ye-iOS

source: Share your wisdom with the world.
zu: Abelana ngobuhlakani bakho nomhlaba wonke.

source: Show:
zu: Veza:

source: Show after
zu: Khombisa kamuva

source: Show All
zu: Veza konke

source: Show all questions
zu: Veza yonke imibuzo

source: Show details &raquo;
zu: Veza imininingwane &raquo;

source: Show Everything
zu: Veza Yonke into

source: Show Helpfulness Votes Chart
zu: Veza Ishadi Lamavoti Okuba Usizo

source: Show History
zu: Veza Umlando

source: Show information for:
zu: Veza imininingwane yalokhu:

source: Showing questions tagged:
zu: Kukhonjiswa imibuzo ethegiwe:

source: Show less
zu: Veza okumbalwa

source: Show me
zu: Ngikhombise

source: Show media for:
zu: Veza imidiya ye:

source: Show more
zu: Veza okunye okuthe xaxa

source: Show translations
zu: Veza izihumusho

source: Show Translations
zu: Veza Izihumusho

source: Show translations | {document}
zu: Veza izihumusho | {document}

source: Show until
zu: Khombisa kuze kube

source: Signed in!
zu: Ususayinele ukungena!

source: Significance:
zu: Ukubaluleka:

source: Significance - MT: Major Content Changes. M: Content Changes. Empty: Minor Changes.
zu: Ukubaluleka - MT: Izinguquko Ezinkulu Zokuqukethwe . M: Izinguquko Zokuqukethwe . Akunalutho: Izinguquko Ezimbalwa Zokuqukethwe.

source: Sign in and connect to Twitter
zu: Sayinela ukungena bese uxhuma ku-Twitter

source: Signing in...
zu: Usayinela ukungena...

source: Sign in to Mozilla Support
zu: Sayinela ukungena ku-Mozilla Support

source: Sign out
zu: Sayinela ukuphuma

source: Sign up as a volunteer
zu: Sayinela ukuba yivolontiya

source: "%s" is too large (%sKB), the limit is %sKB
zu: "%s" inkulu kakhulu (%sKB), umkhawulo %sKB

source: Sit back and relax. Our forum contributors will get back to you with an answer.
zu: Hlala unethezeke. Abanegalelo bethu kusithangami bazobuyela kuwena nempendulo.

source: {sitename} Password Reset
zu: {sitename} Ukusethwa kabusha kwephasiwedi

source: Sites Affected
zu: Amasayithi athintekayo

source: Skip to main content
zu: Yeqa uye kokusemqoka

source: Skip to search
zu: Yeqa uye kocinga

source: Slowness or hanging
zu: Ukudonseka noma ukulenga

source: Slug:
zu: I-slug:

source: Slug in {locale}:
zu: I-slug e{locale}:

source: solution
zu: isisombululo

source: Solution chosen
zu: Isisombululo esikhethiwe

source: Solution chosen by {user}
zu: Isisombululo sikhethwe ngu {user}

source: Solution didn't work
zu: Isisombululo asisebenzanga

source: Solution found for question: %s
zu: Isisombululo sitholiwe sombuzo: %s

source: Solution found to Firefox Help question
zu: Isisombululo Sitholiwe sombuzo wosizo lwe-Firefox

source: Solution provided
zu: Isisombululo sihlinzekiwe

source: solved
zu: kusonjululiwe

source: Solved
zu: Kusonjululiwe

source: % Solved
zu: % Okusonjululiwe

source: Solved the problem
zu: Isombululile inkinga

source: Solves the problem
zu: Iyayisombulula inkinga

source: Solving 1 issue helps up to 1,000 users a day
zu: Ukusombulula inkinga e-1 kusiza abasebenzisi abangafinyelela ku-1 000 ngosuku

source: Solving 1 issue helps up to 1,000 users a day!
zu: Ukusombulula inkinga e-1 kusiza abasebenzisi abangafinyelela ku-1 000 ngosuku!

source: Some features on this page are temporarily disabled while we perform website maintenance. Please try again a little later.
zu: Amanye amafisha kuleli khasi acinyiwe okwesikhashana ngenkathi sisalungisa iwebhusayithi. Uyacelwa uphinde uzame emva kwesikhashana.

source: Some text will appear in the empty box.
zu: Omunye umbhalo uzovela ebhokisini elingenalutho.

source: Something is wrong
zu: Kukhona okungalungile

source: Sorry! Search is currently unavailable. Please try again soon.
zu: Siyaxolisa! Ukucinga akutholakali okwamanje. Uyacelwa uphinde uzame kungekudala.

source: Sorry to hear that.
zu: Kwakubi ukuzwa lokho.

source: Sorry, we couldn't find the page you were looking for. Please, try searching our site using the form below.
zu: Siyaxolisa, asikwazanga ukuthola ikhasi obulifuna. Uyacelwa, ukuba uzame ukucinga isayithi yethu usebenzisa ifomu elingezansi.

source: Sort options
zu: Hlela izinketho

source: Sort results by
zu: Kuhlelwe ngokwemiphumela

source: Source Code
zu: Ikhodi Yomthombo

source: Spam or other unrelated content
zu: I-spam noma okunye okungahlobene

source: <span class="key">Accessibility</span>: No
zu: <span class="key">Ukufinyeleleka</span>: Cha

source: <span class="key">Accessibility</span>: Yes
zu: <span class="key">Ukufinyeleleka</span>: Yebo

source: <span class="key">User JS</span>: No
zu: <span class="key">Umsebenzisi JS</span>: Cha

source: <span class="key">User JS</span>: Yes
zu: <span class="key">Umsebenzisi JS</span>: Yebo

source: %s posted an answer to your question "%s"
zu: %s uphoste impendulo yombuzo wakho "%s"

source: Stale
zu: Okudala

source: Start
zu: Isiqalo

source: Start:
zu: Qala:

source: Start answering!
zu: Qala uphendule!

source: Status
zu: Isimo

source: Stay in touch
zu: Hlala uxhumene

source: Stay up to date with news feeds, blogs and social features
zu: Hlala wazi konke okwenzekayo ngama-news feeds namafisha ezokuxhumana emphakathini

source: Sticky
zu: Beka ekuqaleni

source: Sticky this thread
zu: Beka lolu chungechunge phambili

source: Stop article emails
zu: Misa ama-imeyli e-athikhili

source: Stop email updates
zu: Misa izindaba ezintsha ze-imeyli

source: Stop Ignoring
zu: Yeka ukuziba

source: Stop receiving updates via email for this question.
zu: Misa ukuthola izindaba zakamuva nge-imeyli zalo mbuzo.

source: Stop watching this forum
zu: Yeka ukubuka lesi sithangami

source: Stop watching this locale
zu: Yeka ukubuka le ndawo

source: Stop watching this thread
zu: Yima ukubuka lolu chungechunge

source: <strong>0</strong> questions in the last <strong>24 hours</strong> have no reply. <strong>Good job!</strong>
zu: <strong>0</strong> imibuzo emahoreni <strong>angama-24 adlule</strong> ayinampendulo. <strong>Umsebenzi oncomekayo!</strong>

source: <strong>%(awarder)s</strong> has awarded you the <strong>%(title)s</strong> badge!
zu: <strong>%(awarder)s</strong> ukuhlomulise i <strong>%(title)s</strong> bheji!

source: <strong>{product}</strong> Support Forum
zu: <strong>{product}</strong> Isithangami Sokweseka

source: <strong>%(recent_unanswered_count)s question</strong> has no reply.
zu: <strong>%(recent_unanswered_count)s imibuzo</strong> ayinazimpendulo.

source: <strong>%(recent_unanswered_count)s</strong> question in the last <strong>24 hours</strong> has no reply. <a href="%(url)s">Help solve it!</a>
zu: <strong>%(recent_unanswered_count)s</strong> imibuzo emahoreni <strong>angama-24 adlule</strong> awunampendulo. <a href="%(url)s">Siza ukuzisombulula!</a>

source: <strong>Warning:</strong> Accounts created before December 2010 may have issues logging in. Please reset your password below.
zu: <strong>Isexwayiso:</strong> Ama-akhawunti enziwe ngaphambi kukaZibandlela ngowezi-2010 angaba nezinkinga lapho kulogelwa ukungena. Uyacela ukuba uhlele kabusha iphasiwedi yakho ngezansi.

source: <strong>Warning:</strong> This revision has KB Helpfulness Votes associated with it. Deleting this revision will cause those votes to be deleted as well.
zu: <strong>Isexwayiso:</strong> Isibukezo Sinamavoti e-KB Okuba Usizo ahlobene naso. Ukudilitha lesi sibukezo kuzodala ukuthi nalawo mavoti adilitheke.

source: Subject:
zu: Isihloko:

source: Submit for Review
zu: Letha Isibukezo

source: Submit Issue
zu: Letha udaba

source: Submitted {locale} translation:
zu: Ilethwe {locale} isihumusho:

source: Submitted revision:
zu: Isibukezo esilethiwe:

source: Submitted Revision Changes
zu: Izinguquko Zesibukezo Zilethiwe

source: Submitted translation:
zu: Isihumusho esilethiwe:

source: Submitted Translation Changes
zu: Izinguquko Zokuhumusha Ezilethiwe

source: Submit Your Changes
zu: Letha Izinguquko zakho

source: Subscribe...
zu: Bhalisela ukuthola imininingwane...

source: Subscribe to edit notifications
zu: Bhalisela ukuthola izaziso zokulungisa

source: Subscribe to feed
zu: Bhalisela ukuthola i-feed

source: Subscription confirmed.
zu: Ukubhalisa kuqinisekisiwe.

source: Successfully activated
zu: Iqaliswe ukusebenza ngempumelelo

source: Summarize your question in a sentence
zu: Fingqa umbuzo wakho ube umusho

source: Summary:
zu: Isifingqo:

source: [SUMO] You have a new private message from [{sender}]
zu: [SUMO] Unomyalezo omusha wasesithe ovela ku[{sender}]

source: Support article:
zu: Okokweseka i-athikhili:

source: Support Forum
zu: Isithangami Sabeseki

source: Support Forum Home
zu: Ikhaya Lesithangami Sokweseka

source: Support Forum Metrics
zu: Amamethriksi Esithangami Sokweseka

source: Support Questions
zu: Imibuzo Esekelayo

source: Support URL: {support_url}
zu: I-URL Yokweseka: {support_url}

source: Switch language
zu: Shintsha ulimi

source: Switch to desktop site
zu: Shintshela kusayithi ye-desktop

source: Switch to edit mode
zu: Shintshela kumodi lokuhlela amagama

source: Switch to mobile site
zu: Shintshela kusayithi e-mobile

source: Switch to preview mode
zu: Shintshela kumodi yesibukisi kuqala

source: sync
zu: qondanisa

source: System
zu: Uhlelo

source: System Details
zu: Imininingwane yohlelo

source: Systems and Languages
zu: Izinhlelo Nezilimi

source: Tab basics
zu: Ulwazi oluyisisekelo ngamathebhu

source: Table of Contents
zu: Ithebhula Lokuqukethwe

source: Tabs
zu: Amathebhu

source: Tab settings
zu: Amasethingi ethebhu

source: Tags
zu: Amathegi

source: Take Action:
zu: Yenza okuthile:

source: Take pictures, record videos and listen to music on your Firefox OS phone.
zu: Shutha izithombe, qopha amavidiyo uphinde ulalele umculo efonini yakho i-Firefox OS.

source: Tap here to go to the mobile version of the site.
zu: Thinta lapha ukuze uye kuveshini yamakhalekhukhwini kusayithi.

source: {t} | {d} Discussion | Knowledge Base
zu: {t} | {d} Ingxoxo| Ulwazi Oluyisisekelo

source: Tell us about yourself!
zu: Sitshele kabanzi!

source: Tell us more.
zu: Sitshele kabanzi.

source: Templates
zu: Amathempulethi

source: Templates are a way of reusing pieces of content across KB articles. You can create and update a set of instructions in one place, and then refer to it in other pages.
zu: Amathempulethi ayindlela yokusebenzisa futhi izingcezu zolwazi kuma-athikhili e-KB. Ungazakhela uphinde uvuselele iqoqo lemiyalelo endaweni eyodwa, uphinde uyicaphune kwamanye amakhasi.

source: Text of the new revision:
zu: Umbhalo wokubukeza kabusha:

source: Thanks,
zu: Siyabonga,

source: Thanks!
zu: Siyabonga!

source: Thanks for joining Mozilla Support! To complete registration, you need to verify your email address.
zu: Siyabpnga ngokujoyina i-Mozilla Support! Ukuqedela ukubhalisa, kudingeka uqinisekise ikheli lakho le-imeyli.

source: Thanks for letting us know you have this problem.
zu: Siyabonga ngokuba usazise ukuthi unale nkinga.

source: Thanks for making us better!
zu: Siyabonga ngokusenza sibe ngcono!

source: Thanks for taking the time to review these changes. Clicking Accept will make this version of the article live! Please take a moment to be sure all options are correct.
zu: Siyabonga ngokuba uzinike isikhathi sokubukeza lezi zinguquko. Kuchofoza ukuthi Amukela kuzokwenza le veshini ye-athikhili ibe bukhoma! Uyacelwa uke uthathe ithuba lokuqinisekisa ukuthi konke ongakhetha kukho kuyanemba.

source: Thanks for taking the time to review these changes. Please thank the editor and then give specific, constructive feedback about what you feel needs to change in order for the revision to be acceptable.
zu: Siyabonga ukuba uzinikeze isikhathi sokubukeza lezi zinguquko. Uyacelwa ukubaubonge umhleli bese unikeza izimpendulo eziqondile, ezakhayo mayelana nalokho ocabanga ukuthi kudingek akushintshe ukuze isibukezo samukeleke.

source: Thanks for your help! Just so you know, Firefox OS is not available in your locale yet, and it's possible this article will change before it is.
zu: Siyabonga ngosizo lwakho! Ukuze nje wazi, i-Firefox OS ayitholakali endaweni yakho okwamanje, futhi kungenzeka ukuthi le athikhili ingashintsha ngaphambi kokuba itholakale.

source: Thanks so much for your interest in helping users of Mozilla technologies!
zu: Sibonga kakhulu ngentshisekelo yakho ukusiza abasebenzisi bezobuchwepheshe bakwa-Mozilla!

source: Thanks, The Mozilla Support team
zu: Siyabonga, yithimba le-Mozilla Support

source: Thank you for being awesome!
zu: Siyabonga ngokuba ube ngohlaba umxhwele!

source: Thank you for choosing a solution!
zu: Siyabonga ngokukhetha isisombululo!

source: Thank you for registering!
zu: Siyabonga ngokuba ubhalise!

source: Thank you for your contribution to Mozilla Support!
zu: Ngaphambi kokuxhuma ku-Twitter, kufanele usayinele ukungena ku-Mozilla Support!

source: Thank you for your first contribution to the Mozilla support forums! You just made somebody's day!
zu: Siyabonga ngegalelo lakho lokuqala ezinkundleni zokweseka zakwa-Mozilla! Usuwenze usuku lomunye umuntu waluthokozela!
